In [249]:
import matplotlib.pyplot as plt
import numpy as np
import seaborn
import pandas as pd
from pandas import DataFrame, Series
%matplotlib inline

In [250]:
batting_data = pd.read_csv('Data/core/Batting.csv', sep = ",", dtype = str)

In [251]:
batting_data.head()

,playerID,yearID,stint,teamID,lgID,G,AB,R,H,2B,...,RBI,SB,CS,BB,SO,IBB,HBP,SH,SF,GIDP
0,abercda01,1871,1,TRO,NaN,1,4,0,0,0,...,0,0,0,0,0,NaN,NaN,NaN,NaN,NaN
1,addybo01,1871,1,RC1,NaN,25,118,30,32,6,...,13,8,1,4,0,NaN,NaN,NaN,NaN,NaN
2,allisar01,1871,1,CL1,NaN,29,137,28,40,4,...,19,3,1,2,5,NaN,NaN,NaN,NaN,NaN
3,allisdo01,1871,1,WS3,NaN,27,133,28,44,10,...,27,1,1,0,2,NaN,NaN,NaN,NaN,NaN
4,ansonca01,1871,1,RC1,NaN,25,120,29,39,11,...,16,6,2,2,1,NaN,NaN,NaN,NaN,NaN

In [252]:
salary_data = pd.read_csv('Data/core/Salaries.csv', sep = ",", dtype = str)

In [253]:
salary_data.head()

  yearID teamID lgID   playerID  salary
0   1985    ATL   NL  barkele01  870000
1   1985    ATL   NL  bedrost01  550000
2   1985    ATL   NL  benedbr01  545000
3   1985    ATL   NL   campri01  633333
4   1985    ATL   NL  ceronri01  625000

In [254]:
fielding_data = pd.read_csv('Data/core/Fielding.csv', sep = ",", dtype = str)

In [255]:
fielding_data.head()

,playerID,yearID,stint,teamID,lgID,POS,G,GS,InnOuts,PO,A,E,DP,PB,WP,SB,CS,ZR
0,abercda01,1871,1,TRO,NaN,SS,1,NaN,NaN,1,3,2,0,NaN,NaN,NaN,NaN,NaN
1,addybo01,1871,1,RC1,NaN,2B,22,NaN,NaN,67,72,42,5,NaN,NaN,NaN,NaN,NaN
2,addybo01,1871,1,RC1,NaN,SS,3,NaN,NaN,8,14,7,0,NaN,NaN,NaN,NaN,NaN
3,allisar01,1871,1,CL1,NaN,2B,2,NaN,NaN,1,4,0,0,NaN,NaN,NaN,NaN,NaN
4,allisar01,1871,1,CL1,NaN,OF,29,NaN,NaN,51,3,7,1,NaN,NaN,NaN,NaN,NaN

In [256]:
batting_and_salary = pd.merge(batting_data, salary_data)

In [257]:
batting_and_salary.head()

,playerID,yearID,stint,teamID,lgID,G,AB,R,H,2B,...,SB,CS,BB,SO,IBB,HBP,SH,SF,GIDP,salary
0,ackerji01,1985,1,TOR,AL,61,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,170000
1,agostju01,1985,1,CHA,AL,54,0,0,0,0,...,0,0,0,0,0,0,0,0,0,147500
2,aguaylu01,1985,1,PHI,NL,91,165,27,46,7,...,1,0,22,26,5,6,4,3,7,237000
3,alexado01,1985,1,TOR,AL,36,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,875000
4,allenne01,1985,1,SLN,NL,23,2,0,0,0,...,0,0,0,2,0,0,0,0,0,750000

How do I get a column from the third file into the merged file?

In [258]:
amalgamated_data = pd.merge(batting_and_salary, fielding_data).drop_duplicates()

In [259]:
amalgamated_data.head()

,playerID,yearID,stint,teamID,lgID,G,AB,R,H,2B,...,POS,GS,InnOuts,PO,A,E,DP,PB,WP,ZR
0,ackerji01,1985,1,TOR,AL,61,NaN,NaN,NaN,NaN,...,P,0,259,10,16,0,1,NaN,NaN,NaN
1,alexado01,1985,1,TOR,AL,36,NaN,NaN,NaN,NaN,...,P,36,782,28,32,1,4,NaN,NaN,NaN
2,atherke01,1985,1,OAK,AL,56,NaN,NaN,NaN,NaN,...,P,0,314,4,6,1,0,NaN,NaN,NaN
3,beattji01,1985,1,SEA,AL,18,NaN,NaN,NaN,NaN,...,P,15,211,4,6,1,0,NaN,NaN,NaN
4,beckwjo01,1985,1,KCA,AL,49,NaN,NaN,NaN,NaN,...,P,0,285,7,12,2,1,NaN,NaN,NaN

In [272]:
relevant_data = amalgamated_data[['playerID', 'yearID', 'AB', 'H', 'BB', 'HBP', 'SF', 'salary', 'POS']]

In [273]:
relevant_data.head()

    playerID yearID   AB    H   BB  HBP   SF  salary POS
0  ackerji01   1985  NaN  NaN  NaN  NaN  NaN  170000   P
1  alexado01   1985  NaN  NaN  NaN  NaN  NaN  875000   P
2  atherke01   1985  NaN  NaN  NaN  NaN  NaN  107333   P
3  beattji01   1985  NaN  NaN  NaN  NaN  NaN  470000   P
4  beckwjo01   1985  NaN  NaN  NaN  NaN  NaN  358000   P

~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

In [263]:
float_data = relevant_data[['yearID', 'AB', 'H', 'BB', 'HBP', 'SF', 'salary']].astype(float)

In [293]:
float_data.head()

   yearID  AB   H  BB  HBP  SF    salary
0  1985.0 NaN NaN NaN  NaN NaN  170000.0
1  1985.0 NaN NaN NaN  NaN NaN  875000.0
2  1985.0 NaN NaN NaN  NaN NaN  107333.0
3  1985.0 NaN NaN NaN  NaN NaN  470000.0
4  1985.0 NaN NaN NaN  NaN NaN  358000.0

In [ ]:
cleaned_data = float_data.fillna(0)

In [265]:
cleaned_data.head()

   yearID   AB    H   BB  HBP   SF    salary
0  1985.0  0.0  0.0  0.0  0.0  0.0  170000.0
1  1985.0  0.0  0.0  0.0  0.0  0.0  875000.0
2  1985.0  0.0  0.0  0.0  0.0  0.0  107333.0
3  1985.0  0.0  0.0  0.0  0.0  0.0  470000.0
4  1985.0  0.0  0.0  0.0  0.0  0.0  358000.0

In [276]:
another_temp = pd.concat([relevant_data, cleaned_data], axis = 1)

In [268]:
to_merge_data = amalgamated_data[['playerID', 'POS', 'salary']]

In [294]:
merged_data = pd.concat([to_merge_data, cleaned_data], axis = 1)

In [295]:
merged_data.head(10)

    playerID POS  salary  yearID   AB    H   BB  HBP   SF    salary
0  ackerji01   P  170000  1985.0  0.0  0.0  0.0  0.0  0.0  170000.0
1  alexado01   P  875000  1985.0  0.0  0.0  0.0  0.0  0.0  875000.0
2  atherke01   P  107333  1985.0  0.0  0.0  0.0  0.0  0.0  107333.0
3  beattji01   P  470000  1985.0  0.0  0.0  0.0  0.0  0.0  470000.0
4  beckwjo01   P  358000  1985.0  0.0  0.0  0.0  0.0  0.0  358000.0
5  birtsti01   P   60000  1985.0  0.0  0.0  0.0  0.0  0.0   60000.0
6  blackbu02   P  465000  1985.0  0.0  0.0  0.0  0.0  0.0  465000.0
7  blylebe01   P  650000  1985.0  0.0  0.0  0.0  0.0  0.0  650000.0
8   boydoi01   P  177500  1985.0  0.0  0.0  0.0  0.0  0.0  177500.0
9  burnsbr01   P  727500  1985.0  0.0  0.0  0.0  0.0  0.0  727500.0

In [296]:
def get_obp(hits, walks, hit_by_pitch, at_bats, sacrifice_flies):
    return ((hits + walks + hit_by_pitch)/(at_bats + walks + hit_by_pitch + sacrifice_flies))

In [303]:
merged_data['OBP'] = get_obp(cleaned_data['H'], cleaned_data['BB'], cleaned_data['HBP'], cleaned_data['AB'], cleaned_data['SF'])

In [318]:
merged_data.head()

    playerID POS  salary  yearID   AB    H   BB  HBP   SF    salary  OBP
0  ackerji01   P  170000  1985.0  0.0  0.0  0.0  0.0  0.0  170000.0  NaN
1  alexado01   P  875000  1985.0  0.0  0.0  0.0  0.0  0.0  875000.0  NaN
2  atherke01   P  107333  1985.0  0.0  0.0  0.0  0.0  0.0  107333.0  NaN
3  beattji01   P  470000  1985.0  0.0  0.0  0.0  0.0  0.0  470000.0  NaN
4  beckwjo01   P  358000  1985.0  0.0  0.0  0.0  0.0  0.0  358000.0  NaN

In [319]:
merged_data_cleaned = merged_data.fillna(0)

In [320]:
# cleaned_data = cleaned_data.fillna(0)

In [321]:
no_perfect = merged_data_cleaned.drop(merged_data_cleaned[merged_data_cleaned.OBP == 1].index)

In [322]:
no_perfect.head()

    playerID POS  salary  yearID   AB    H   BB  HBP   SF    salary  OBP
0  ackerji01   P  170000  1985.0  0.0  0.0  0.0  0.0  0.0  170000.0  0.0
1  alexado01   P  875000  1985.0  0.0  0.0  0.0  0.0  0.0  875000.0  0.0
2  atherke01   P  107333  1985.0  0.0  0.0  0.0  0.0  0.0  107333.0  0.0
3  beattji01   P  470000  1985.0  0.0  0.0  0.0  0.0  0.0  470000.0  0.0
4  beckwjo01   P  358000  1985.0  0.0  0.0  0.0  0.0  0.0  358000.0  0.0

In [323]:
has_obp = no_perfect.drop(no_perfect[no_perfect.OBP == 0].index)

In [324]:
has_obp.head()

,playerID,POS,salary,yearID,AB,H,BB,HBP,SF,salary,OBP
413,rodriru01,C,62500,1988.0,5.0,1.0,0.0,0.0,0.0,62500.0,0.200000
712,tinglro01,C,100000,1990.0,3.0,0.0,1.0,0.0,0.0,100000.0,0.250000
795,knorrra01,C,100000,1991.0,1.0,0.0,1.0,0.0,0.0,100000.0,0.500000
1308,princto01,C,275000,1994.0,6.0,2.0,1.0,0.0,0.0,275000.0,0.428571
1529,sweenmi01,C,109000,1995.0,4.0,1.0,0.0,0.0,0.0,109000.0,0.250000

In [325]:
len(has_obp)

5

In [306]:
current_players = merged_data.drop(merged_data[merged_data.yearID < 2014].index)

In [308]:
current_players.head()

       playerID POS   salary  yearID   AB    H   BB  HBP   SF     salary  OBP
1892  lairdge01   C  1000000  2015.0  2.0  0.0  0.0  0.0  0.0  1000000.0  NaN